<!DOCTYPE html>
  <html >
   
    <h1> 今日の漢字は: </h1>
    
    <h1 style=font-size:200px>
      <?php
        $str = "人一丨口日目儿見凵山出十八木未丶来大亅了子心土冂田思二丁彳行寸寺時卜上丿刀分厶禾私中彐尹事可亻何自乂又皮彼亠方生月門間扌手言女本乙气気干年三耂者刂前勹勿豕冖宀家今下白勺的云牛物立小文矢知入乍作聿書学合";
        $r=rand(0,100) ;
        echo mb_substr($str,  $r, 1) ;
        echo "<script language='javascript' type='text/javascript'>";
        echo "alert('roと漢字へようこそ');";
        echo "</script>";
      ?>
     </h1>
     
    <h1>
       <?php
         $kanji = "一丁七万丈三上下不与丐丑且丕世丗丘丙丞両並丨个中丱串丶丸丹主丼丿乂乃久之乍乎乏乕乖乗乘乙九乞也乢乱乳乾亀亂亅了予争亊事二于云互五井亘亙些亜亞亟亠亡亢交亥亦亨享京亭亮亰亳亶人亻什仁仂仄仆仇今介仍从仏仔仕他仗付仙仞仟代令以仭仮仰仲件价任企伉伊伍伎伏伐休会伜伝伯估伴伶伸伺似伽佃但佇位低住佐佑体何佗余佚佛作佝佞佩佯佰佳併佶佻佼使侃來侈例侍侏侑侖侘供依侠価侫侭侮侯侵侶便係促俄俊俎俐俑俔俗俘俚俛保俟信俣俤俥修俯俳俵俶俸俺俾倅倆";
         $r=rand(0,6300) ;
         echo mb_substr($kanji,  $r, 1) ;
       ?>
     </h1>
  
  </html>
